In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
import seaborn as sns
from matplotlib.animation import PillowWriter
from statsmodels.stats.outliers_influence import variance_inflation_factor
from sklearn import preprocessing

In [20]:
data = pd.read_csv("98guide6.csv")
df98 = pd.DataFrame(data)

# Create a new column with the fullname of the car
df98["FullName"] = "1998 " + df98["Manufacturer"] + " " + df98["carline name"]
print(df98.head())

         Class  Manufacturer carline name  displ  cyl       trans drv  cty  \
0  TWO SEATERS         ACURA          NSX    3.0    6    Auto(L4)   R   18
1  TWO SEATERS         ACURA          NSX    3.2    6  Manual(M6)   R   17
2  TWO SEATERS  ASTON MARTIN    DB7 COUPE    3.2    6    Auto(L4)   R   14
3  TWO SEATERS  ASTON MARTIN    DB7 COUPE    3.2    6  Manual(M5)   R   14
4  TWO SEATERS  ASTON MARTIN  DB7 VOLANTE    3.2    6    Auto(L4)   R   14

   hwy  cmb  ...  2pv  2lv  4pv 4lv hpv hlv fcost   eng dscr   trans dscr  \
0   24   20  ...  NaN  NaN  NaN NaN NaN NaN  1050  DOHC VTEC  2MODE CLKUP
1   24   20  ...  NaN  NaN  NaN NaN NaN NaN  1050  DOHC VTEC          NaN
2   20   16  ...  NaN  NaN  NaN NaN NaN NaN  1312  ASTON-DB7        CLKUP
3   21   16  ...  NaN  NaN  NaN NaN NaN NaN  1312  ASTON-DB7          NaN
4   20   16  ...  NaN  NaN  NaN NaN NaN NaN  1312  ASTON-DB7        CLKUP

                        FullName
0                 1998 ACURA NSX
1                 1998 ACURA NSX
2    1998 ASTON MARTIN DB7 COUPE
3    1998 ASTON MARTIN DB7 COUPE
4  1998 ASTON MARTIN DB7 VOLANTE

[5 rows x 27 columns]

In [21]:
dataTypes = df98.dtypes.to_frame(name='Data Types') # turn data types into data frame

dataTypes # prints data types

             Data Types
Class            object
Manufacturer     object
carline name     object
displ           float64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
cmb               int64
ucty            float64
uhwy            float64
ucmb            float64
fl               object
G                object
T                object
S                object
2pv             float64
2lv             float64
4pv             float64
4lv             float64
hpv             float64
hlv             float64
fcost             int64
eng dscr         object
trans dscr       object
FullName         object

In [22]:
is_clean = df98.isnull().sum() # finds any missing values for each column and sums it

print(is_clean) # print results

Class             0
Manufacturer      0
carline name      0
displ             0
cyl               0
trans             0
drv               0
cty               0
hwy               0
cmb               0
ucty              0
uhwy              0
ucmb              0
fl                0
G               771
T               728
S               794
2pv             657
2lv             657
4pv             518
4lv             518
hpv             711
hlv             711
fcost             0
eng dscr        633
trans dscr      299
FullName          0
dtype: int64

# Fill in the rest of the data

### 99

In [25]:
data = pd.read_csv("Data\99guide6.csv")
df99 = pd.DataFrame(data)

# Create a new column with the fullname of the car
df99["FullName"] = "1999 " + df99["Manufacturer"] + " " + df99["carline name"]
print(df99.head())

         Class Manufacturer carline name  displ  cyl       trans drv  cty  \
0  TWO SEATERS        ACURA          NSX    3.0    6    Auto(L4)   R   18
1  TWO SEATERS        ACURA          NSX    3.2    6  Manual(M6)   R   17
2  TWO SEATERS          BMW      M COUPE    3.2    6  Manual(M5)   R   19
3  TWO SEATERS          BMW   M ROADSTER    3.2    6  Manual(M5)   R   19
4  TWO SEATERS          BMW     Z3 COUPE    2.8    6    Auto(L4)   R   19

   hwy  cmb  ...  2pv  2lv  4pv 4lv hpv hlv fcost   eng dscr   trans dscr  \
0   24   20  ...  NaN  NaN  NaN NaN NaN NaN   975  DOHC-VTEC  2MODE CLKUP
1   24   20  ...  NaN  NaN  NaN NaN NaN NaN   975  DOHC-VTEC          NaN
2   26   22  ...  NaN  NaN  NaN NaN NaN NaN   785        NaN          NaN
3   26   22  ...  NaN  NaN  NaN NaN NaN NaN   785        NaN          NaN
4   26   22  ...  NaN  NaN  NaN NaN NaN NaN   785        NaN          NaN

              FullName
0       1999 ACURA NSX
1       1999 ACURA NSX
2     1999 BMW M COUPE
3  1999 BMW M ROADSTER
4    1999 BMW Z3 COUPE

[5 rows x 27 columns]

### 2000

In [38]:
data = pd.read_csv("Data\\2000.csv")
df00 = pd.DataFrame(data)
df00["FullName"] = "2000 " + df00["Manufacturer"] + " " + df00["carline name"]
print(df00.head())
is_clean = df00["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class Manufacturer carline name  displ  cyl       trans drv  cty  \
0  TWO SEATERS        ACURA          NSX    3.0    6    Auto(L4)   R   17
1  TWO SEATERS        ACURA          NSX    3.2    6  Manual(M6)   R   17
2  TWO SEATERS          BMW      M COUPE    3.2    6  Manual(M5)   R   19
3  TWO SEATERS          BMW     Z3 COUPE    2.8    6    Auto(L4)   R   19
4  TWO SEATERS          BMW     Z3 COUPE    2.8    6  Manual(M5)   R   19

   hwy  cmb  ...  4pv  4lv  hpv hlv fcost   eng dscr trans dscr  vpc  cls  \
0   24   20  ...  NaN  NaN  NaN NaN  1012  DOHC-VTEC      2MODE    4    1
1   24   20  ...  NaN  NaN  NaN NaN  1012  DOHC-VTEC        NaN    4    1
2   26   21  ...  NaN  NaN  NaN NaN   964        NaN        NaN    4    1
3   26   22  ...  NaN  NaN  NaN NaN   921        NaN        NaN    4    1
4   26   21  ...  NaN  NaN  NaN NaN   964        NaN        NaN    4    1

            FullName
0     2000 ACURA NSX
1     2000 ACURA NSX
2   2000 BMW M COUPE
3  2000 BMW Z3 COUPE
4  2000 BMW Z3 COUPE

[5 rows x 29 columns]
Empty cmb rows: 0

### 2001

In [39]:
data = pd.read_csv("Data\\2001.csv")
df01 = pd.DataFrame(data)
df01["FullName"] = "2001 " + df01["Manufacturer"] + " " + df01["carline name"]
print(df01.head())
is_clean = df01["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class Manufacturer         carline name  displ  cyl       trans drv  \
0  TWO SEATERS        ACURA                  NSX    3.0    6    Auto(S4)   R
1  TWO SEATERS        ACURA                  NSX    3.2    6  Manual(M6)   R
2  TWO SEATERS         AUDI          TT ROADSTER    1.8    4  Manual(M5)   F
3  TWO SEATERS         AUDI  TT ROADSTER QUATTRO    1.8    4  Manual(M6)   4
4  TWO SEATERS          BMW             Z3 COUPE    3.0    6  Manual(M5)   R

   cty  hwy  cmb  ...  4pv  4lv  hpv hlv fcost   eng dscr trans dscr  vpc  \
0   17   24   20  ...  NaN  NaN  NaN NaN  1162  DOHC-VTEC      2MODE    4
1   17   24   19  ...  NaN  NaN  NaN NaN  1223  DOHC-VTEC        NaN    4
2   22   30   25  ...  NaN  NaN  NaN NaN   930        NaN        NaN    5
3   20   28   23  ...  NaN  NaN  NaN NaN  1011        NaN        NaN    5
4   21   28   24  ...  NaN  NaN  NaN NaN   970        NaN        NaN    4

   cls                       FullName
0    1                 2001 ACURA NSX
1    1                 2001 ACURA NSX
2    1          2001 AUDI TT ROADSTER
3    1  2001 AUDI TT ROADSTER QUATTRO
4    1              2001 BMW Z3 COUPE

[5 rows x 29 columns]
Empty cmb rows: 0

### 2002

In [40]:
data = pd.read_csv("Data\\2002.csv")
df02 = pd.DataFrame(data)
df02["FullName"] = "2002 " + df02["Manufacturer"] + " " + df02["carline name"]
print(df02.head())
is_clean = df02["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class  Manufacturer           carline name  displ  cyl       trans  \
0  TWO SEATERS         ACURA                    NSX    3.0    6    Auto(S4)
1  TWO SEATERS         ACURA                    NSX    3.2    6  Manual(M6)
2  TWO SEATERS  ASTON MARTIN  ASTON MARTIN VANQUISH    5.9   12    Auto(S6)
3  TWO SEATERS          AUDI            TT ROADSTER    1.8    4  Manual(M5)
4  TWO SEATERS          AUDI    TT ROADSTER QUATTRO    1.8    4  Manual(M6)

  drv  bidx  cty  hwy  ...  4pv  4lv  hpv  hlv fcost   eng dscr trans dscr  \
0   R    60   17   24  ...  NaN  NaN  NaN  NaN  1238  DOHC-VTEC      2MODE
1   R    65   17   24  ...  NaN  NaN  NaN  NaN  1302  DOHC-VTEC        NaN
2   R     1   12   19  ...  NaN  NaN  NaN  NaN  1651    GUZZLER      CLKUP
3   F    18   22   31  ...  NaN  NaN  NaN  NaN   953        NaN        NaN
4   4    18   20   28  ...  NaN  NaN  NaN  NaN  1077        NaN        NaN

   vpc  cls                                 FullName
0  4.0    1                           2002 ACURA NSX
1  4.0    1                           2002 ACURA NSX
2  4.0    1  2002 ASTON MARTIN ASTON MARTIN VANQUISH
3  5.0    1                    2002 AUDI TT ROADSTER
4  5.0    1            2002 AUDI TT ROADSTER QUATTRO

[5 rows x 30 columns]
Empty cmb rows: 0

### 2003

In [41]:
data = pd.read_csv("Data\\2003.csv")
df03 = pd.DataFrame(data)
df03["FullName"] = "2003 " + df03["Manufacturer"] + " " + df03["carline name"]
print(df03.head())
is_clean = df03["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class Manufacturer            carline name  displ  cyl       trans  \
0  TWO SEATERS        ACURA                     NSX    3.0    6    Auto(S4)
1  TWO SEATERS        ACURA                     NSX    3.2    6  Manual(M6)
2  TWO SEATERS       ALPINA  BMW/ALPINA ROADSTER V8    4.8    8    Auto(L5)
3  TWO SEATERS         AUDI             TT ROADSTER    1.8    4    Auto(S6)
4  TWO SEATERS         AUDI     TT ROADSTER QUATTRO    1.8    4  Manual(M6)

  drv  bidx  cty  hwy  ...  4pv  4lv  hpv  hlv fcost eng dscr    trans dscr  \
0   R    55   17   24  ...  NaN  NaN  NaN  NaN  1238           2MODE CLKUP
1   R    75   17   24  ...  NaN  NaN  NaN  NaN  1302                    NaN
2   R    48   14   21  ...  NaN  NaN  NaN  NaN  1455  GUZZLER  2MODE CLKUP
3   F    18   20   28  ...  NaN  NaN  NaN  NaN  1077           3MODE CLKUP
4   4    18   20   29  ...  NaN  NaN  NaN  NaN  1077                    NaN

   vpc  cls                            FullName
0  4.0    1                      2003 ACURA NSX
1  4.0    1                      2003 ACURA NSX
2  4.0    1  2003 ALPINA BMW/ALPINA ROADSTER V8
3  5.0    1               2003 AUDI TT ROADSTER
4  5.0    1       2003 AUDI TT ROADSTER QUATTRO

[5 rows x 30 columns]
Empty cmb rows: 0

### 2004

In [42]:
data = pd.read_csv("Data\\2004.csv")
df04 = pd.DataFrame(data)
df04["FullName"] = "2004 " + df04["Manufacturer"] + " " + df04["carline name"]
print(df04.head())
is_clean = df04["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class Manufacturer         carline name  displ  cyl       trans drv  \
0  TWO SEATERS        ACURA                  NSX    3.0    6    Auto(S4)   R
1  TWO SEATERS        ACURA                  NSX    3.2    6  Manual(M6)   R
2  TWO SEATERS         AUDI          TT ROADSTER    1.8    4    Auto(S6)   F
3  TWO SEATERS         AUDI  TT ROADSTER QUATTRO    1.8    4  Manual(M6)   4
4  TWO SEATERS         AUDI  TT ROADSTER QUATTRO    3.2    6    Auto(S6)   4

   bidx  cty  hwy  ...  4pv  4lv  hpv  hlv fcost eng dscr    trans dscr  vpc  \
0    65   17   24  ...  NaN  NaN  NaN  NaN  1200     DOHC  2MODE CLKUP   4.0
1    75   17   24  ...  NaN  NaN  NaN  NaN  1200     DOHC           NaN  4.0
2    18   20   28  ...  NaN  NaN  NaN  NaN  1044           3MODE CLKUP   5.0
3    18   20   28  ...  NaN  NaN  NaN  NaN  1044                    NaN  5.0
4     9   22   27  ...  NaN  NaN  NaN  NaN  1001                 3MODE   5.0

   cls                       FullName
0    1                 2004 ACURA NSX
1    1                 2004 ACURA NSX
2    1          2004 AUDI TT ROADSTER
3    1  2004 AUDI TT ROADSTER QUATTRO
4    1  2004 AUDI TT ROADSTER QUATTRO

[5 rows x 30 columns]
Empty cmb rows: 0

### 2005

In [43]:
data = pd.read_csv("Data\\2005.csv")
df05 = pd.DataFrame(data)
df05["FullName"] = "2005 " + df05["Manufacturer"] + " " + df05["carline name"]
print(df05.head())
is_clean = df05["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

         Class Manufacturer         carline name  displ  cyl       trans drv  \
0  TWO SEATERS        ACURA                  NSX    3.0    6    Auto(S4)   R
1  TWO SEATERS        ACURA                  NSX    3.2    6  Manual(M6)   R
2  TWO SEATERS         AUDI          TT ROADSTER    1.8    4    Auto(S6)   F
3  TWO SEATERS         AUDI  TT ROADSTER QUATTRO    1.8    4  Manual(M6)   4
4  TWO SEATERS         AUDI  TT ROADSTER QUATTRO    3.2    6    Auto(S6)   4

   bidx  cty  hwy  ...  4pv  4lv  hpv  hlv fcost eng dscr    trans dscr  vpc  \
0    62   17   24  ...  NaN  NaN  NaN  NaN  1462     DOHC  2MODE CLKUP   4.0
1    71   17   24  ...  NaN  NaN  NaN  NaN  1462     DOHC           NaN  4.0
2    13   20   28  ...  NaN  NaN  NaN  NaN  1272           3MODE CLKUP   5.0
3    13   20   29  ...  NaN  NaN  NaN  NaN  1272                    NaN  5.0
4    15   22   27  ...  NaN  NaN  NaN  NaN  1220                 3MODE   5.0

   cls                       FullName
0    1                 2005 ACURA NSX
1    1                 2005 ACURA NSX
2    1          2005 AUDI TT ROADSTER
3    1  2005 AUDI TT ROADSTER QUATTRO
4    1  2005 AUDI TT ROADSTER QUATTRO

[5 rows x 30 columns]
Empty cmb rows: 0

### 2006

In [ ]:
data = pd.read_csv("Data\\2006.csv")
df06 = pd.DataFrame(data)
df06["FullName"] = "2006 " + df06["Manufacturer"] + " " + df06["carline name"]
print(df06.head())
is_clean = df06["cmb"].isnull().sum()
print("Empty cmb rows:",is_clean)

### 2007

In [46]:
data = pd.read_csv("Data\\2007.csv")
df07 = pd.DataFrame(data)
df07["FullName"] = "2007 " + df07["MFR"] + " " + df07["CAR LINE"]
print(df07.head())
is_clean = df07["COMB MPG (GUIDE)"].isnull().sum()
print("Empty cmb rows:",is_clean)

         CLASS           MFR        CAR LINE  DISPLACEMENT  NUMB CYL  \
0  TWO SEATERS  ASTON MARTIN      V8 VANTAGE           4.3         8
1  TWO SEATERS  ASTON MARTIN  V8 VANTAGE ASM           4.3         8
2  TWO SEATERS           BMW         Z4 3.0I           3.0         6
3  TWO SEATERS           BMW         Z4 3.0I           3.0         6
4  TWO SEATERS           BMW        Z4 3.0SI           3.0         6

        TRANS DRIVE SYS  INDEX NUMB  CITY MPG (GUIDE)  HWY MPG (GUIDE)  ...  \
0  Manual(M6)         R          11                14               20  ...
1    Auto(S6)         R          12                15               21  ...
2  Manual(M6)         R          30                20               30  ...
3    Auto(S6)         R          30                21               30  ...
4  Manual(M6)         R          30                20               30  ...

   AVG 4D LUGG VOL  AVG HB PAS VOL  AVG HB LUGG VOL  ANL FL CST ENG BLK TXT  \
0              NaN             NaN              NaN        2672
1              NaN             NaN              NaN        2514
2              NaN             NaN              NaN        1783
3              NaN             NaN              NaN        1783
4              NaN             NaN              NaN        1783

  TRANS DESC TXT VLVS PER CYL CLS  5C CODE                          FullName
0            NaN          4.0   1      NaN      2007 ASTON MARTIN V8 VANTAGE
1         4MODE           4.0   1      NaN  2007 ASTON MARTIN V8 VANTAGE ASM
2            NaN          4.0   1      NaN                  2007 BMW Z4 3.0I
3   3MODE CLKUP           4.0   1      NaN                  2007 BMW Z4 3.0I
4            NaN          4.0   1      NaN                 2007 BMW Z4 3.0SI

[5 rows x 31 columns]
Empty cmb rows: 0

### 2008

In [55]:
data = pd.read_csv("Data\\2008.csv")
df08 = pd.DataFrame(data)
df08["FullName"] = "2008 " + df08["MFR"] + " " + df08["CAR LINE"]
print(df08[['FullName', 'COMB MPG (GUIDE)']].head())
is_clean = df08["COMB MPG (GUIDE)"].isnull().sum()
print("Empty cmb rows:",is_clean)

                       FullName  COMB MPG (GUIDE)
0  2008 ASTON MARTIN V8 VANTAGE                15
1  2008 ASTON MARTIN V8 VANTAGE                15
2                  2008 AUDI R8                15
3                  2008 AUDI R8                15
4         2008 AUDI TT ROADSTER                25
Empty cmb rows: 0

### 2009

In [48]:
data = pd.read_csv("Data\\2009.csv")
df09 = pd.DataFrame(data)
df09["FullName"] = "2009 " + df09["MFR"] + " " + df09["CAR LINE"]
print(df09.head())
is_clean = df09["COMB MPG (GUIDE)"].isnull().sum()
print("Empty cmb rows:",is_clean)

         CLASS           MFR    CAR LINE  DISPLACEMENT  NUMB CYL       TRANS  \
0  TWO SEATERS  ASTON MARTIN   DBS COUPE           5.9        12    Auto(S6)
1  TWO SEATERS  ASTON MARTIN   DBS COUPE           5.9        12  Manual(M6)
2  TWO SEATERS  ASTON MARTIN  V8 VANTAGE           4.7         8    Auto(S6)
3  TWO SEATERS  ASTON MARTIN  V8 VANTAGE           4.7         8  Manual(M6)
4  TWO SEATERS          AUDI          R8           4.2         8  Manual(M6)

  DRIVE SYS  INDEX NUMB  CITY MPG (GUIDE)  HWY MPG (GUIDE)  ...  Unnamed: 141  \
0         R         6.0                12               18  ...           NaN
1         R         1.0                11               17  ...           NaN
2         R         5.0                13               19  ...           NaN
3         R         4.0                12               19  ...           NaN
4         4        26.0                12               19  ...           NaN

  Unnamed: 142 Unnamed: 143 Unnamed: 144 Unnamed: 145 Unnamed: 146  \
0          NaN          NaN          NaN          NaN          NaN
1          NaN          NaN          NaN          NaN          NaN
2          NaN          NaN          NaN          NaN          NaN
3          NaN          NaN          NaN          NaN          NaN
4          NaN          NaN          NaN          NaN          NaN

  Unnamed: 147 Unnamed: 148  Unnamed: 149                      FullName
0          NaN          NaN           NaN   2009 ASTON MARTIN DBS COUPE
1          NaN          NaN           NaN   2009 ASTON MARTIN DBS COUPE
2          NaN          NaN           NaN  2009 ASTON MARTIN V8 VANTAGE
3          NaN          NaN           NaN  2009 ASTON MARTIN V8 VANTAGE
4          NaN          NaN           NaN                  2009 AUDI R8

[5 rows x 151 columns]
Empty cmb rows: 0

### 2010

In [61]:
data = pd.read_csv("Data\\2010.csv", low_memory=False)
df10 = pd.DataFrame(data)
empty_cols = [col for col in df10.columns if df10[col].isnull().all()]
df10.drop(empty_cols, axis=1, inplace=True)
df10["FullName"] = "2010 " + df10["Mfr Name"] + " " + df10["Carline"]
print(df10[['FullName','Comb FE (Guide) - Conventional Fuel']].head())
is_clean = df10["Comb FE (Guide) - Conventional Fuel"].isnull().sum()
print("Empty cmb rows:",is_clean)

                       FullName  Comb FE (Guide) - Conventional Fuel
0  2010 aston martin V8 Vantage                                   16
1  2010 aston martin V8 Vantage                                   14
2                  2010 Audi R8                                   15
3                  2010 Audi R8                                   15
4                  2010 Audi R8                                   16
Empty cmb rows: 0

### 2010

In [ ]:
data = pd.read_csv("Data\\2010.csv", low_memory=False)
df10 = pd.DataFrame(data)
empty_cols = [col for col in df10.columns if df10[col].isnull().all()]
df10.drop(empty_cols, axis=1, inplace=True)
df10["FullName"] = "2010 " + df10["Mfr Name"] + " " + df10["Carline"]
print(df10[['FullName','Comb FE (Guide) - Conventional Fuel']].head())
is_clean = df10["Comb FE (Guide) - Conventional Fuel"].isnull().sum()
print("Empty cmb rows:",is_clean)

### 2010

In [ ]:
data = pd.read_csv("Data\\2010.csv", low_memory=False)
df10 = pd.DataFrame(data)
empty_cols = [col for col in df10.columns if df10[col].isnull().all()]
df10.drop(empty_cols, axis=1, inplace=True)
df10["FullName"] = "2010 " + df10["Mfr Name"] + " " + df10["Carline"]
print(df10[['FullName','Comb FE (Guide) - Conventional Fuel']].head())
is_clean = df10["Comb FE (Guide) - Conventional Fuel"].isnull().sum()
print("Empty cmb rows:",is_clean)

### 2010

In [ ]:
data = pd.read_csv("Data\\2010.csv", low_memory=False)
df10 = pd.DataFrame(data)
empty_cols = [col for col in df10.columns if df10[col].isnull().all()]
df10.drop(empty_cols, axis=1, inplace=True)
df10["FullName"] = "2010 " + df10["Mfr Name"] + " " + df10["Carline"]
print(df10[['FullName','Comb FE (Guide) - Conventional Fuel']].head())
is_clean = df10["Comb FE (Guide) - Conventional Fuel"].isnull().sum()
print("Empty cmb rows:",is_clean)

### 2010

In [ ]:
data = pd.read_csv("Data\\2010.csv", low_memory=False)
df10 = pd.DataFrame(data)
empty_cols = [col for col in df10.columns if df10[col].isnull().all()]
df10.drop(empty_cols, axis=1, inplace=True)
df10["FullName"] = "2010 " + df10["Mfr Name"] + " " + df10["Carline"]
print(df10[['FullName','Comb FE (Guide) - Conventional Fuel']].head())
is_clean = df10["Comb FE (Guide) - Conventional Fuel"].isnull().sum()
print("Empty cmb rows:",is_clean)